# Задание 1. Зависимость цены квартиры от её площади
# Условие:
# Имеются данные о площади 10 квартир (в кв. метрах) и их стоимости (в млн рублей).
# •	Площадь: [35, 42, 54, 62, 71, 85, 93, 104, 115, 128]
# •	Цена: [8.4, 11.3, 14.6, 19.8, 22.1, 28.9, 33.5, 41.6, 49.5, 58.9]
# Постройте диаграмму рассеяния. Сделайте маркеры в виде круглых точек синего цвета, добавьте прозрачность, чтобы точки не перекрывали друг друга, и подпишите оси.


import matplotlib.pyplot as plt


s_home = [35, 42, 54, 62, 71, 85, 93, 104, 115, 128]
price = [8.4, 11.3, 14.6, 19.8, 22.1, 28.9, 33.5, 41.6, 49.5, 58.9]
plt.scatter(s_home, price, color='blue', alpha=0.6, marker='o')
plt.title('Зависимость цены квартиры от её площади', fontsize = 14, fontweight = 'bold')
plt.xlabel('Площадь квартир (кв. метр) ', fontsize = 12)
plt.ylabel('Стоимость (млн. руб.) ', fontsize = 12)
plt.show()


# Задание 2. Сравнение объемов продаж разных категорий товаров
#
# Условие:
# Маркетплейс подвел итоги продаж за месяц по четырем категориям товаров:
# •	Электроника — 450 тыс. руб.
# •	Одежда — 320 тыс. руб.
# •	Книги — 180 тыс. руб.
# •	Дом и сад — 290 тыс. руб.
# Постройте вертикальную столбчатовую диаграмму. Задайте для каждого столбика свой цвет, настройте ширину столбцов и добавьте сетку только по оси Y,
# чтобы было удобнее считывать значения.

# "коды" на цвета смотрела в интернете

categories = ['Электроника', 'Одежда', 'Книги', 'Дом и сад']
sales = [450, 320, 180, 290]
plt.figure(figsize=(8,5))
plt.bar(categories, sales, color = ['#34495e', '#f1948a', '#85c1e9', '#f7dc6f'], edgecolor = 'black', width = 0.4)
plt.title('Сравнение объемов продаж', fontsize = 14, fontweight = 'bold')
plt.xlabel('Категории товаров', fontsize = 12)
plt.ylabel('Продажи за месяц', fontsize = 12)
plt.grid(axis='y', linestyle='-', alpha=0.5)
plt.show()
