# Задача 1:Анимации и интерактивность в графиках (с использованием Plotly)
#
# Условие: Используя произвольные данные, создав DataFrame постройте анимированный график,
# показывающий изменения температуры в вашем городе по месяцам.


import pandas as pd
import plotly.express as px

# Я НЕ ЗНАЮ КАК СДЕЛАТЬ, ЧТОБЫ АНИМАЦИЯ ОТОБРАЖАЛАСЬ МЕДЛЕННО;

data = {
    "Месяц": ["Янв", "Фев", "Март", "Апр", "Май", "Июн", "Июл", "Авг", "Сен", "Окт", "Ноя", "Дек"],
    "Температура": [0.0, 5.3, 7.4, 12.5, 21.7, 30.5, 35.1, 35.8, 25.6, 12.3, 6.8, 2.3],
}
df = pd.DataFrame(data)

fig = px.bar(
    df,
    x="Месяц",
    y="Температура",
    animation_frame="Месяц",
    color="Температура",
    range_y=[-5, 40],
    title="Погода в Краснодаре за 12 месяцев"
)

fig.show()



# Задача 2: Основы Layout (с использованием Dash)
# Цель: создать базовое приложение, настроить структуру страницы и отобразить простой график.
#
# Задание:
# Создайте приложение, которое содержит заголовок "Мой первый дашборд" (тег H1) и линейный график (Line Chart)
# функций y = x² для значений x от 1 до 5.


import plotly.express as px
from dash import Dash, dcc, html


x = [1, 2, 3, 4, 5]
y = [1, 4, 9, 16, 25]
fig = px.line(x=x, y=y,  title="График функции Y = X²")

app = Dash()
app.layout = html.Div([
    html.H1("Мой первый дашборд"),
    dcc.Graph(figure=fig)
])
if __name__ == '__main__':
    app.run(debug=True)