
# Задача 1:Столбчатая диаграмма (Bar Chart)
#
# Условие: Используя встроенный датасет gapminder для Канады (country == 'Canada'),
# постройте столбчатую диаграмму, которая отражает динамику изменения численности населения (pop) по годам (year).


import plotly.express as px
import pandas as pd



df = px.data.gapminder()
df_canada = df[df['country'] == 'Canada']
fig = px.bar(
    df_canada,
    x='year',
    y='pop',
    title='Динамика изменения численности населения Канады',
    labels={'pop': 'Численность населения', 'year': 'Год'},
    color="pop",
)
fig.show()

# Задача 2: Солнечные лучи / Круговая диаграмма (Sunburst Chart)
#
# Условие: Используя встроенный датасет tips, визуализируйте иерархическую структуру структуры чаевых.
# Постройте диаграмму «солнечные лучи» (Sunburst), которая показывает распределение чеков сначала по дням недели
# (day), затем по времени суток (time),
# а внутри – по статусу курения (smoker). Размер секторов должен зависеть от общего счета (total_bill).



df = px.data.tips()
fig = px.sunburst(
    df,
    path=['day', 'time', 'smoker'],
    values='total_bill',
    title='Иерархическая структура чаевых (tips)',
    labels={
        'day': 'День недели',
        'time': 'Время суток',
        'smoker': 'Статус курения',
        'total_bill': 'Общая сумма счетов'
    }
)

fig.show()